Revit 2027 API
FileDialog.Show Method
 Shows the dialog using the stored settings.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ItemSelectionDialogResult Show()
Public Function Show As ItemSelectionDialogResult
public:
ItemSelectionDialogResult Show()
member Show : unit -> ItemSelectionDialogResult
Return Value
ItemSelectionDialogResult
 A status indicating whether the user selected a file name or cancelled the dialog without making a selection.
See Also
Reference
FileDialog Class
Autodesk.Revit.UI Namespace